{
  "Formación": "Education",
  "Estudios que me han dado la base para comenzar como desarrollador junior.": "Studies that gave me the foundation to start as a junior developer.",
  "📚 Sigo formándome con proyectos pequeños, cursos online y práctica constante.": "📚 I keep learning with small projects, online courses and constant practice.",
  "Contacto": "Contact",
  "¿Tienes un proyecto en mente? Escríbeme y vemos cómo puedo ayudarte 🚀": "Got a project in mind? Message me and let's see how I can help 🚀",
  "Email": "Email",
  "Respuesta en menos de 24 horas": "Reply within 24 hours",
  "Ubicación": "Location",
  "Barcelona, España": "Barcelona, Spain",
  "Disponible para trabajar en remoto": "Available for remote work",
  "También puedes encontrarme en:": "You can also find me on:",
  "Envíame un mensaje": "Send me a message",

  "Desarrollo de Aplicaciones Web (FP Grado Superior)": "Web Application Development (Higher Vocational Training)",
  "Institut TIC de Barcelona": "Institut TIC de Barcelona",
  "Formación enfocada en fundamentos de programación, desarrollo web y bases de datos. Proyectos sencillos para aprender practicando y trabajo en equipo.": "Training focused on programming fundamentals, web development and databases. Simple projects to learn by doing and teamwork.",
  "Programación Orientada a Objetos": "Object-Oriented Programming",
  "Bases de datos": "Databases",
  "Desarrollo Frontend": "Frontend Development",
  "Desarrollo Backend": "Backend Development",
  "Prácticas en empresa": "Company Internship",

  "Bachillerato Tecnológico": "Technological Baccalaureate",
  "Institut Quatre Cantons": "Institut Quatre Cantons",
  "Orientación técnica con base en matemáticas, física, tecnología e informática.": "Technical orientation based on mathematics, physics, technology and computer science.",
  "Tecnología": "Technology",
  "Informática": "Computer Science",
  "Matemáticas": "Mathematics",
  "Ciencias aplicadas": "Applied sciences",

  "nav.about": "About me",
  "nav.projects": "Projects",
  "nav.technologies": "Technologies",
  "nav.experience": "Experience",
  "nav.education": "Education",
  "nav.contact": "Contact",
  "nav.language": "Language",
  "nav.openMenu": "Open menu",

  "hero.dev": "",
  "hero.junior": "Junior Developer",
  "hero.learning": "learning to build web projects with",
  "hero.modernTechs": "modern technologies",
  "hero.subtitle": "I like practicing with React, Node.js and a bit of Python, and I aim to improve with every project.",
  "hero.cta.work": "See my work",
  "hero.cta.talk": "Let's talk",
  "hero.follow": "Follow me",
  "hero.discoverMore": "Discover more",
"Desarrollador Fullstack (Junior)": "Full-stack Developer (Junior)",
  "Dando mis primeros pasos con proyectos sencillos y muchas ganas de aprender y mejorar.": "Taking my first steps with simple projects and lots of motivation to learn and improve.",

  "Soy un desarrollador junior que disfruta construyendo": "I'm a junior developer who enjoys building",
  "pequeños proyectos": "small projects",
  "para aprender haciendo.": "to learn by doing.",
  "Me siento cómodo con": "I'm comfortable with",
  "React, Tailwind y Node.js": "React, Tailwind and Node.js",
  "a nivel básico, y sigo mejorando con práctica constante. También tengo conocimientos introductorios en": "at a basic level, and I keep improving with constant practice. I also have introductory knowledge of",
  "Python": "Python",
  "y he empezado a explorar el mundo de la": "and I've started exploring the world of",
  "inteligencia artificial": "artificial intelligence",
  ", un área que me interesa mucho y en la que quiero seguir profundizando.": ", an area I'm very interested in and want to keep learning about.",
  "Busco oportunidades para": "I'm looking for opportunities to",
  "colaborar, aprender de un equipo experimentado y crecer profesionalmente": "collaborate, learn from an experienced team and grow professionally",
  ", aportando motivación y ganas de mejorar en cada proyecto.": ", bringing motivation and a desire to improve to every project.",

  "Enfoque en Aprender": "Focus on Learning",
  "Estoy empezando y me centro en entender bien los fundamentos. Mi objetivo es mejorar cada día y aplicar lo aprendido en proyectos sencillos.": "I'm just getting started and focus on mastering the fundamentals. My goal is to improve every day and apply what I learn in simple projects.",
  "Pasión por la Tecnología": "Passion for Technology",
  "Aunque soy principiante, disfruto programar y probar herramientas nuevas. Cada reto es una oportunidad para crecer.": "Although I'm a beginner, I enjoy coding and trying new tools. Every challenge is a chance to grow.",
  "Primeros Proyectos": "First Projects",
  "He realizado algunos proyectos personales que me ayudan a practicar. Quiero seguir acumulando experiencia y aportar más valor.": "I've built a few personal projects to practice. I want to keep gaining experience and bringing more value.",

  "Código Simple": "Simple Code",
  "Intento mantener mis proyectos ordenados y claros.": "I try to keep my projects tidy and clear.",
  "Aprendizaje Constante": "Continuous Learning",
  "Voy mejorando mis habilidades paso a paso con constancia.": "I improve my skills step by step with consistency.",
  "Curiosidad": "Curiosity",
  "Me gusta explorar tecnologías nuevas aunque esté en etapa inicial.": "I like exploring new technologies even at an early stage.",

  "Mis Proyectos": "My Projects",
  "Algunos de los proyectos que he realizado para practicar y mejorar mis habilidades como desarrollador junior.": "Some of the projects I have built to practice and improve my skills as a junior developer.",
  "Stack": "Stack",
  "Código": "Code",
  "Demo": "Demo",
  "Ver más proyectos en GitHub": "See more projects on GitHub",

  "Portfolio Personal": "Personal Portfolio",
  "Portfolio actual creado con React y Tailwind, desplegado en Vercel. Aquí muestro mis proyectos y lo que voy aprendiendo como desarrollador junior.": "Current portfolio built with React and Tailwind, deployed on Vercel. Here I showcase my projects and what I’m learning as a junior developer.",

  "Blog Fullstack": "Fullstack Blog",
  "Aplicación fullstack de un blog sobre tecnología, desarrollado con React y Tailwind en el frontend, y Node.js, Express y MongoDB en el backend.": "Fullstack blog application about technology, built with React and Tailwind on the frontend, and Node.js, Express and MongoDB on the backend.",

  "Chatbot Personal": "Personal Chatbot",
  "Chatbot entrenado con mi información personal para que reclutadores y visitantes puedan interactuar conmigo. Proyecto en proceso.": "Chatbot trained with my personal information so recruiters and visitors can interact with me. Project in progress.",

  "En proceso": "In progress",
  
  "Stack Tecnológico": "Tech Stack",
  "Tecnologías que estoy aprendiendo y usando en mis proyectos.": "Technologies I am learning and using in my projects.",

  "Frontend": "Frontend",
  "Backend": "Backend",
  "Bases_de_datos": "Databases",
  "Herramientas": "Tools",

  "HTML5": "HTML5",
  "CSS": "CSS",
  "JavaScript": "JavaScript",
  "React": "React",
  "TailwindCSS": "TailwindCSS",
  "Node.js": "Node.js",
  "Express": "Express",
  "Python_": "Python",
  "Django": "Django",
  "FastAPI": "FastAPI",
  "PHP": "PHP",
  "PostgreSQL": "PostgreSQL",
  "MongoDB": "MongoDB",
  "GitHub": "GitHub",
  "Git": "Git",
  "Copilot": "Copilot",
  "VS Code": "VS Code",
  "OpenAI API": "OpenAI API",

   "Experiencia": "Experience",
  "Prácticas y primeros pasos en entornos reales, con foco en aprender y aportar.": "Internships and first steps in real environments, focused on learning and contributing.",

  "Desarrollador en Prácticas": "Intern Developer",
  "Iris Technology Solutions": "Iris Technology Solutions",
  "Barcelona, España_": "Barcelona, Spain",
  "Septiembre 2024 − Marzo 2025": "September 2024 − March 2025",

  "Apoyo en desarrollo de simulaciones 2D en Java. Primer contacto con metodologías ágiles, trabajo en equipo y control de versiones.": "Assisted in developing 2D simulations in Java. First experience with agile methodologies, teamwork, and version control.",

  "Tareas / logros:": "Tasks / Achievements:",
  "Simulaciones 2D interactivas con Java (lógica básica y rendering).": "Interactive 2D simulations with Java (basic logic and rendering).",
  "Desarrollo de pequeñas funcionalidades aplicando principios de POO.": "Developed small features applying OOP principles.",
  "Práctica con estructuras de control, colecciones y lógica aplicada en Java.": "Practiced with control structures, collections, and applied logic in Java.",
  "Trabajo en ejercicios prácticos centrados en lógica y fundamentos de programación.": "Worked on practical exercises focused on logic and programming fundamentals.",

  "Sobre mí": "About me",
  "Tecnologías": "Technologies",
  "Experiencia_": "Experience",
  "Proyectos": "Projects",
  "Contacto_": "Contact",
  "Junior Fullstack • Aprendiendo cada día": "Junior Fullstack • Learning every day",
  "Hecho con React y Tailwind. Mucho ☕ y ganas de aprender.": "Made with React and Tailwind. Lots of ☕ and willingness to learn."

}
